{
  "backend/main.mo": "Empty Motoko actor placeholder for backend canister.",
  "feature_evidence.json": "Report documenting feature implementation and associated files, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for reference or documentation.",
  "frontend/index.css": "Tailwind base and theme variables defining color system, dark mode values, and global styles.",
  "frontend/index.html": "Root HTML entry for the main SPA that loads the React app.",
  "frontend/public/coupon/index.html": "Standalone HTML entry enabling direct navigation to the /coupon route.",
  "frontend/src/App.tsx": "Sets up TanStack Router with landing and coupon routes wrapped in CopyProvider.",
  "frontend/src/components/CouponCard.tsx": "Renders a decorative Valentine coupon card using themed UI components and copy context values.",
  "frontend/src/components/EditTextPanel.tsx": "Modal editor allowing users to update landing and coupon text fields with save, cancel, and reset actions.",
  "frontend/src/content/CopyContext.tsx": "React context managing editable copy state, draft edits, persistence, and edit‑mode control.",
  "frontend/src/content/defaultCopy.ts": "Defines AppCopy interface and provides default text values for landing and coupon sections.",
  "frontend/src/content/storage.ts": "LocalStorage helpers for loading, saving, clearing, and initializing copy data with validation.",
  "frontend/src/hooks/useActor.ts": "Hook that creates an authenticated or anonymous backend actor and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using Dfinity AuthClient, including login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder module indicating no backend queries are needed for this static app.",
  "frontend/src/index.css": "Defines Tailwind layers, custom CSS variables, and Valentine-themed light/dark styles plus animations and component utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/CouponPage.tsx": "Renders the coupon screen with decorative visuals, navigation controls, an editable coupon card, and themed footer.",
  "frontend/src/pages/ValentineLanding.tsx": "Implements the landing page with background imagery, editable Valentine text, CTA navigation, decorative hearts, and themed footer.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom color variables, animations, shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata including summary, issues, features, and architectural notes for build and development tracking."
}